app/controllers/sessions_controller.rb

  def create
    user = User.find_by(name: params[:name])
---
SELECT  "users".* FROM "users" WHERE "users"."name" IS NULL LIMIT ?  [["LIMIT", 1]]