app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "title", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "grgfg"], ["email", "fgdfgdfgdf@yahoo.com"], ["title", "title11111"], ["created_at", "2017-09-21 06:09:49.407621"], ["updated_at", "2017-09-21 06:09:49.407621"]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save